`terrafom plan -out plan.tfplan`

<details><summary>Show Plan</summary>

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.efs.aws_efs_file_system.efs_fs will be created
  + resource "aws_efs_file_system" "efs_fs" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = "web-app-infra-efs-fs"
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Name" = "web-app-infra-efs-fs"
        }
      + tags_all                = {
          + "Name"        = "web-app-infra-efs-fs"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + throughput_mode         = "bursting"

      + lifecycle_policy {
          + transition_to_ia = "AFTER_30_DAYS"
        }
    }

  # module.efs.aws_efs_mount_target.efs_mount_targets[0] will be created
  + resource "aws_efs_mount_target" "efs_mount_targets" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # module.efs.aws_efs_mount_target.efs_mount_targets[1] will be created
  + resource "aws_efs_mount_target" "efs_mount_targets" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # module.efs.aws_security_group.efs_sg will be created
  + resource "aws_security_group" "efs_sg" {
      + arn                    = (known after apply)
      + description            = "Security group to control access to EFS"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "web-app-infra-efs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "web-app-infra-efs-sg"
        }
      + tags_all               = {
          + "Name"        = "web-app-infra-efs-sg"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                 = (known after apply)
    }

  # module.efs.aws_security_group_rule.allow_nfs will be created
  + resource "aws_security_group_rule" "allow_nfs" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allows port 2409 from the app security group"
      + from_port                = 2409
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2409
      + type                     = "ingress"
    }

  # module.networking.aws_eip.nat_gw_ip[0] will be created
  + resource "aws_eip" "nat_gw_ip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "web-app-infra-eip-0"
        }
      + tags_all             = {
          + "Name"        = "web-app-infra-eip-0"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_eip.nat_gw_ip[1] will be created
  + resource "aws_eip" "nat_gw_ip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "web-app-infra-eip-1"
        }
      + tags_all             = {
          + "Name"        = "web-app-infra-eip-1"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "web-app-infra-igw"
        }
      + tags_all = {
          + "Name"        = "web-app-infra-igw"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_nat_gateway.nat_gw[0] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "web-app-infra-nat-gw-0"
        }
      + tags_all                           = {
          + "Name"        = "web-app-infra-nat-gw-0"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.networking.aws_nat_gateway.nat_gw[1] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "web-app-infra-nat-gw-1"
        }
      + tags_all                           = {
          + "Name"        = "web-app-infra-nat-gw-1"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.networking.aws_route.default_routes[0] will be created
  + resource "aws_route" "default_routes" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.networking.aws_route.default_routes[1] will be created
  + resource "aws_route" "default_routes" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.networking.aws_route_table.route_tables[0] will be created
  + resource "aws_route_table" "route_tables" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "web-app-infra-public-rtb"
        }
      + tags_all         = {
          + "Name"        = "web-app-infra-public-rtb"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.route_tables[1] will be created
  + resource "aws_route_table" "route_tables" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "web-app-infra-private-rtb"
        }
      + tags_all         = {
          + "Name"        = "web-app-infra-private-rtb"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_app_subnets[0] will be created
  + resource "aws_route_table_association" "private_rtb_app_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_app_subnets[1] will be created
  + resource "aws_route_table_association" "private_rtb_app_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_cache_subnets[0] will be created
  + resource "aws_route_table_association" "private_rtb_cache_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_cache_subnets[1] will be created
  + resource "aws_route_table_association" "private_rtb_cache_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_db_subnets[0] will be created
  + resource "aws_route_table_association" "private_rtb_db_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private_rtb_db_subnets[1] will be created
  + resource "aws_route_table_association" "private_rtb_db_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rtb_public_subnets[0] will be created
  + resource "aws_route_table_association" "public_rtb_public_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rtb_public_subnets[1] will be created
  + resource "aws_route_table_association" "public_rtb_public_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rtb_web_subnets[0] will be created
  + resource "aws_route_table_association" "public_rtb_web_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public_rtb_web_subnets[1] will be created
  + resource "aws_route_table_association" "public_rtb_web_subnets" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_subnet.app[0] will be created
  + resource "aws_subnet" "app" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-app-sub-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-app-sub-us-east-1a"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.app[1] will be created
  + resource "aws_subnet" "app" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-app-sub-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-app-sub-us-east-1b"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.cache[0] will be created
  + resource "aws_subnet" "cache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.128.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-cache-sub-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-cache-sub-us-east-1a"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.cache[1] will be created
  + resource "aws_subnet" "cache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.144.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-cache-sub-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-cache-sub-us-east-1b"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.db[0] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.112.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-db-sub-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-db-sub-us-east-1a"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.db[1] will be created
  + resource "aws_subnet" "db" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-db-sub-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-db-sub-us-east-1b"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-pub-sub-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-pub-sub-us-east-1a"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-pub-sub-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-pub-sub-us-east-1b"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.web[0] will be created
  + resource "aws_subnet" "web" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-web-sub-us-east-1a"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-web-sub-us-east-1a"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.web[1] will be created
  + resource "aws_subnet" "web" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "web-app-infra-web-sub-us-east-1b"
        }
      + tags_all                                       = {
          + "Name"        = "web-app-infra-web-sub-us-east-1b"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.web_app will be created
  + resource "aws_vpc" "web_app" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = false
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "web-app-infra-vpc"
        }
      + tags_all                             = {
          + "Name"        = "web-app-infra-vpc"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.rds.aws_db_instance.rds will be created
  + resource "aws_db_instance" "rds" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 3
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "web-app-infra-db-sub-group"
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.35"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "web-app-infra-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "web-app-infra-db"
        }
      + tags_all                              = {
          + "Name"        = "web-app-infra-db"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + timezone                              = (known after apply)
      + username                              = (known after apply)
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_option_group.rds_option_group will be created
  + resource "aws_db_option_group" "rds_option_group" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "8.0"
      + name                     = "mysql-option-group-8-0-35"
      + name_prefix              = (known after apply)
      + option_group_description = "The option group for the RDS instance"
      + tags                     = {
          + "Name" = "mysql-option-group-8-0-35"
        }
      + tags_all                 = {
          + "Name"        = "mysql-option-group-8-0-35"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.rds.aws_db_parameter_group.rds_parameter_group will be created
  + resource "aws_db_parameter_group" "rds_parameter_group" {
      + arn         = (known after apply)
      + description = "The parameter group for the RDS instance"
      + family      = "mysql8.0"
      + id          = (known after apply)
      + name        = "mysql-parameter-group-8-0-35"
      + name_prefix = (known after apply)
      + tags        = {
          + "Name" = "mysql-parameter-group-8-0-35"
        }
      + tags_all    = {
          + "Name"        = "mysql-parameter-group-8-0-35"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.rds.aws_db_subnet_group.rds_subnet_group will be created
  + resource "aws_db_subnet_group" "rds_subnet_group" {
      + arn                     = (known after apply)
      + description             = "The subnet group for the RDS instance"
      + id                      = (known after apply)
      + name                    = "web-app-infra-db-sub-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "web-app-infra-db-sub-group"
        }
      + tags_all                = {
          + "Name"        = "web-app-infra-db-sub-group"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                  = (known after apply)
    }

  # module.rds.aws_security_group.rds_sg will be created
  + resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for the RDS instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "web-app-infra-db-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "web-app-infra-db-sg"
        }
      + tags_all               = {
          + "Name"        = "web-app-infra-db-sg"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                 = (known after apply)
    }

  # module.rds.aws_security_group_rule.allow_admin will be created
  + resource "aws_security_group_rule" "allow_admin" {
      + cidr_blocks              = [
          + "137.83.0.0/16",
        ]
      + description              = "Allows access to the admin public IP address"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.rds.aws_security_group_rule.allow_app_subnets will be created
  + resource "aws_security_group_rule" "allow_app_subnets" {
      + cidr_blocks              = [
          + "10.0.64.0/20",
          + "10.0.80.0/20",
        ]
      + description              = "Allows access to the app subnet"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.rds.aws_ssm_parameter.rds_master_password_parameter will be created
  + resource "aws_ssm_parameter" "rds_master_password_parameter" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/web-app-infra/db/master_password"
      + tags           = {
          + "Name" = "web-app-infra-db-master-password-param"
        }
      + tags_all       = {
          + "Name"        = "web-app-infra-db-master-password-param"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.rds.aws_ssm_parameter.rds_master_username_parameter will be created
  + resource "aws_ssm_parameter" "rds_master_username_parameter" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/web-app-infra/db/master_username"
      + tags           = {
          + "Name" = "web-app-infra-db-master-username-param"
        }
      + tags_all       = {
          + "Name"        = "web-app-infra-db-master-username-param"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.rds.random_password.rds_master_password will be created
  + resource "random_password" "rds_master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.rds.random_string.rds_master_username will be created
  + resource "random_string" "rds_master_username" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.redis.aws_cloudwatch_log_group.redis_log_group will be created
  + resource "aws_cloudwatch_log_group" "redis_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = "STANDARD"
      + name              = "web-app-infra-redis-log-group"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "web-app-infra-redis-log-group"
        }
      + tags_all          = {
          + "Name"        = "web-app-infra-redis-log-group"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.redis.aws_elasticache_parameter_group.redis_parameter_group will be created
  + resource "aws_elasticache_parameter_group" "redis_parameter_group" {
      + arn         = (known after apply)
      + description = "Parameter group for the web-app-infra-redis cluster"
      + family      = "redis7"
      + id          = (known after apply)
      + name        = "web-app-infra-redis-param-group"
      + tags        = {
          + "Name" = "web-app-infra-redis-param-group"
        }
      + tags_all    = {
          + "Name"        = "web-app-infra-redis-param-group"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.redis.aws_elasticache_replication_group.redis_rep_group will be created
  + resource "aws_elasticache_replication_group" "redis_rep_group" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = true
      + auth_token_update_strategy     = "ROTATE"
      + auto_minor_version_upgrade     = "true"
      + automatic_failover_enabled     = true
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "Replication group for the Redis cluster"
      + engine                         = "redis"
      + engine_version                 = "7.1"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = true
      + network_type                   = (known after apply)
      + node_type                      = "cache.t2.micro"
      + num_cache_clusters             = 2
      + num_node_groups                = (known after apply)
      + parameter_group_name           = (known after apply)
      + port                           = 6379
      + preferred_cache_cluster_azs    = [
          + "us-east-1a",
          + "us-east-1b",
        ]
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "web-app-infra-replication-group"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_retention_limit       = 7
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "web-app-infra-redis-sub-group"
      + tags                           = {
          + "Name" = "web-app-infra-redis"
        }
      + tags_all                       = {
          + "Name"        = "web-app-infra-redis"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + transit_encryption_enabled     = (known after apply)

      + log_delivery_configuration {
          + destination      = "web-app-infra-redis-log-group"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "engine-log"
        }
      + log_delivery_configuration {
          + destination      = "web-app-infra-redis-log-group"
          + destination_type = "cloudwatch-logs"
          + log_format       = "json"
          + log_type         = "slow-log"
        }
    }

  # module.redis.aws_elasticache_subnet_group.redis_subnet_group will be created
  + resource "aws_elasticache_subnet_group" "redis_subnet_group" {
      + arn         = (known after apply)
      + description = "Subnet group for the Redis replication group"
      + id          = (known after apply)
      + name        = "web-app-infra-redis-sub-group"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name" = "web-app-infra-redis-sub-group"
        }
      + tags_all    = {
          + "Name"        = "web-app-infra-redis-sub-group"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
    }

  # module.redis.aws_security_group.redis_sg will be created
  + resource "aws_security_group" "redis_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for the web-app-infra-redis cluster"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "web-app-infra-redis-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "web-app-infra-redis-sg"
        }
      + tags_all               = {
          + "Name"        = "web-app-infra-redis-sg"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + vpc_id                 = (known after apply)
    }

  # module.redis.aws_security_group_rule.allow_app_sg will be created
  + resource "aws_security_group_rule" "allow_app_sg" {
      + cidr_blocks              = [
          + "10.0.128.0/20",
          + "10.0.144.0/20",
        ]
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "ingress"
    }

  # module.s3.aws_s3_bucket.storage_and_backup will be created
  + resource "aws_s3_bucket" "storage_and_backup" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "web-app-infra-s3"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "web-app-infra-s3"
        }
      + tags_all                    = {
          + "Name"        = "web-app-infra-s3"
          + "application" = "demo-app"
          + "environment" = "lab"
          + "project"     = "web-app-infra-architecture"
          + "repository"  = "jayrahim/web-app-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_server_side_encryption_configuration.s3_encyrption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "s3_encyrption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

Plan: 54 to add, 0 to change, 0 to destroy.
```
</details>